Repository: csvictorc/Hidrafit
Catalog: lib/l10n/app_*.arb
Languages: pt

# helloUser
source: Hello, {userName} 👋
pt: Olá, {userName} 👋

# helloUserAnonymous
source: Hello, User 👋
pt: Olá, Usuário 👋

source: Hydration Progress
pt: Progresso de hidratação

source: Just drank 💧
pt: Acabei de beber 💧

# stepGoalProgress
source: Walking Goal Progress
pt: Progresso da meta de caminhada

source: Daily Distance
pt: Distância diária

source: Daily Goal
pt: Meta diária

source: Calories Burned
pt: Calorias queimadas

source: Steps Today
pt: Passos hoje

# nextGlassIn
source: until next glass
pt: até o próximo copo

# activityPermissionButton
source: Allow activity recognition
pt: Permitir reconhecimento de atividade

# activityPermissionDenied
source: Activity recognition permission denied.
pt: Permissão de reconhecimento de atividade negada.

# goalReachedTitle
source: Congratulations! 🎉
pt: Parabéns! 🎉

# goalReachedBody
source: You reached your goal of {km} km today!
pt: Você atingiu sua meta de {km} km hoje!

# welcome
source: Welcome to HidraFit
pt: Bem-vindo ao HidraFit

# googleSignInError
source: Failed to authenticate with Google
pt: Falha ao autenticar com o Google

# guestSignInError
source: Failed to sign in as guest
pt: Falha ao entrar como convidado

source: Continue with Google
pt: Continuar com o Google

source: Sign in as Guest
pt: Entrar como Convidado

# alreadyHaveAccount
source: Already have an account? Sign in
pt: Já tem uma conta? Entre

# dontHaveAccountSignUp
source: Don't have an account? Sign up
pt: Não tem uma conta? Cadastre-se

source: Choose Language
pt: Escolha o Idioma

source: Change Language
pt: Mudar Idioma

source: Settings
pt: Configurações

# hydrationReminder
source: Hydration reminders
pt: Lembretes de hidratação

# hydrationReminderDescription
source: Receive notifications to drink water
pt: Receber notificações para beber água

source: Goal completion notification
pt: Notificação de meta atingida

# goalCompletionNotificationDescription
source: Notify when the daily goal is reached
pt: Avisar quando a meta diária for concluída

# viewOnGithub
source: View project on GitHub
pt: Ver projeto no GitHub

source: Logout
pt: Sair

source: Delete Account
pt: Deletar Conta

# english
source: English (USA)
pt: Inglês

# portuguese
source: Português (Brazil)
pt: Português

source: Error logging out
pt: Erro ao sair

# errorOpeningLink
source: Failed to open the link
pt: Não foi possível abrir o link

# profileTitle
source: Profile
pt: Perfil

# nameLabel
source: Name
pt: Nome

# dailyGoalLabel
source: Daily goal (km)
pt: Meta diária (km)

# hydrationIntervalLabel
source: Hydration interval (min)
pt: Intervalo entre copos de água (min)

# saveButton
source: Save
pt: Salvar

# invalidName
source: Enter a valid name.
pt: Digite um nome válido.

# invalidStepGoal
source: Enter a valid goal in kilometers.
pt: Digite uma meta válida em quilômetros.

# invalidHydrationInterval
source: Enter a valid hydration interval (minutes).
pt: Digite um intervalo válido para hidratação (minutos).

# profileSaved
source: Profile saved successfully.
pt: Perfil salvo com sucesso.

# profileSaveError
source: Error saving profile. Try again.
pt: Erro ao salvar perfil. Tente novamente.

# hydrationTitle
source: Time to drink water!
pt: Hora de beber água!

# hydrationMessage
source: Have you had water today? Hydration is essential. Remember to drink water regularly.
pt: Já bebeu água hoje? Hidratação é essencial. Lembre-se de beber água regularmente.

# hydrationConfirmed
source: Ok!
pt: Bebi!

# hydrationNotificationTitle
source: Time to hydrate! 💧
pt: Hora de se hidratar! 💧

# hydrationNotificationBody
source: Drink a glass of water now.
pt: Beba um copo de água agora mesmo.

# hydrationChannelName
source: Hydration Reminders
pt: Lembretes de Hidratação

# hydrationChannelDescription
source: Notifications to remind you to drink water
pt: Notificações para lembrar de beber água

# permissionNeeded
source: Permission needed to track your activity.
pt: Permissão necessária para rastrear sua atividade.

source: Request Permission
pt: Solicitar Permissão

# activityPermissionRequest
source: Permission needed to track your activity
pt: Permissão necessária para rastrear sua atividade.

# cupRegistered
source: Water cup added!
pt: Copinho registrado
